{
    "translations": {
        "de": {
            "Zoning & Demand Manager": "Zonen- & Bedarfs-Manager",
            "Help & Documentation": "Hilfe & Dokumentation",
            "doc_intro": "Dieses Modul ist die Master-Regel-Engine für ein Mehrzonen-HVAC-System. Es steuert einzelne Raumklappen und bestimmt, welche Räume Kühlung anfordern.",
            "doc_h_general": "Allgemeine Einstellungen",
            "doc_debug": "<b>Enable Debug Logging:</b> Aktivieren, um detaillierte Log-Nachrichten im Meldungsfenster zu sehen. Nützlich für die Fehlersuche.",
            "doc_timer": "<b>Processing Interval:</b> Die Frequenz in Sekunden, mit der das Modul seine Logik ausführt. Empfohlen: 60-300.",
            "doc_h_overrides": "Systemweite Sperren & Steuerungen",
            "doc_heating": "<b>Heating Active Link:</b> Verknüpfen Sie eine boolesche Variable, die WAHR ist, wenn die Heizung läuft. Dies deaktiviert die Kühlung.",
            "doc_ventilation": "<b>Ventilation Active Link:</b> Optional. Verknüpfen Sie eine Variable, die WAHR ist, wenn eine allgemeine Lüftung aktiv ist, um die Kühlung zu sperren.",
            "doc_fan": "<b>Main Fan Control:</b> Verknüpfung zur Ein/Aus-Steuerung des Hauptlüfters.",
            "doc_ac": "<b>Main AC Unit:</b> Verknüpfung zum Ein/Aus-Schalter der Hauptklimaanlage.",
            "doc_masterbed": "<b>Master Bedroom Special Mode Link:</b> Verknüpfung zu einer Integer-Variable. Wenn der Wert nicht 0 ist und die Kühlung aus ist, wird der Lüfter für die Ventilation im Schlafzimmer aktiviert.",
            "doc_status": "<b>System Status Text Variable:</b> Optional. Eine String-Variable, in die der aktuelle Systemstatus geschrieben wird.",
            "doc_h_rooms": "Konfiguration der gesteuerten Räume",
            "doc_r_name": "<b>Room Name:</b> Ein benutzerfreundlicher Name. Muss exakt mit dem Namen im 'Adaptive Cooling' Modul übereinstimmen für den Spezialmodus.",
            "doc_r_temp": "<b>Temp Sensor:</b> Die Variable, die die aktuelle Raumtemperatur meldet.",
            "doc_r_target": "<b>Target Temp:</b> Die Variable, die die Soll-Temperatur für den Raum enthält.",
            "doc_r_window": "<b>Window/Door Sensor Category:</b> Eine Kategorie, die alle Türkontaktsensoren für diesen Raum enthält. Wenn ein Sensor WAHR meldet, wird der Raum deaktiviert.",
            "doc_r_demand": "<b>Demand Output:</b> Wichtigste Verknüpfung. Verbinden Sie hier die 'Demand'-Variable, die vom 'Adaptive Cooling' Modul gelesen wird.",
            "doc_r_flap": "<b>Flap Control Variable:</b> Die Variable, die die physische Luftklappe für diesen Raum steuert.",
            "doc_r_flaptype": "<b>Flap Type:</b> Definiert, ob die Klappe ein- und ausgeschaltet (Boolean) oder auf einen Wert gesetzt wird (Linear).",
            "doc_r_flapopen": "<b>Value for OPEN:</b> Der exakte Wert, der die Klappe öffnet (z.B. 'true', 'false', '0', '100').",
            "doc_r_flapclosed": "<b>Value for CLOSED:</b> Der exakte Wert, der die Klappe schließt (z.B. 'false', 'true', '100', '0')."
        },
        "en": {
            "Zoning & Demand Manager": "Zoning & Demand Manager",
            "Help & Documentation": "Help & Documentation",
            "doc_intro": "This module is the master rule engine for a multi-zone HVAC system. It controls individual room flaps and determines which rooms are demanding cooling.",
            "doc_h_general": "General Settings",
            "doc_debug": "<b>Enable Debug Logging:</b> Check to see detailed log messages in the messages window. Useful for troubleshooting.",
            "doc_timer": "<b>Processing Interval:</b> The frequency in seconds at which the module runs its logic. Recommended: 60-300.",
            "doc_h_overrides": "System-Wide Overrides & Controls",
            "doc_heating": "<b>Heating Active Link:</b> Link a boolean variable that is TRUE when heating is running. This will disable cooling.",
            "doc_ventilation": "<b>Ventilation Active Link:</b> Optional. Link a variable that is TRUE when general ventilation is active to disable cooling.",
            "doc_fan": "<b>Main Fan Control:</b> Link to the on/off control for the main fan.",
            "doc_ac": "<b>Main AC Unit:</b> Link to the on/off switch for the main air conditioning unit.",
            "doc_masterbed": "<b>Master Bedroom Special Mode Link:</b> Link to an integer variable. If its value is not 0 and cooling is off, the fan will be activated for ventilation in the master bedroom.",
            "doc_status": "<b>System Status Text Variable:</b> Optional. A string variable where the current system status will be written.",
            "doc_h_rooms": "Controlled Rooms Configuration",
            "doc_r_name": "<b>Room Name:</b> A user-friendly name. Must exactly match the name in the 'Adaptive Cooling' module for the special mode to work.",
            "doc_r_temp": "<b>Temp Sensor:</b> The variable that reports the current room temperature.",
            "doc_r_target": "<b>Target Temp:</b> The variable that holds the desired target temperature for the room.",
            "doc_r_window": "<b>Window/Door Sensor Category:</b> A category containing all door/window contact sensors for this room. If any sensor reports TRUE, the room will be deactivated.",
            "doc_r_demand": "<b>Demand Output:</b> Most important link. Connect the 'Demand' variable here that is read by the 'Adaptive Cooling' module.",
            "doc_r_flap": "<b>Flap Control Variable:</b> The variable that directly controls the physical air flap for this room.",
            "doc_r_flaptype": "<b>Flap Type:</b> Defines if the flap is switched on/off (Boolean) or set to a value (Linear).",
            "doc_r_flapopen": "<b>Value for OPEN:</b> The exact value needed to open the flap (e.g., 'true', 'false', '0', '100').",
            "doc_r_flapclosed": "<b>Value for CLOSED:</b> The exact value needed to close the flap (e.g., 'false', 'true', '100', '0')."
        }
    }
}
